app/views/mood/index.html.erb

<br><br>
<p> <%= link_to 'Current Users:', users_path %> <%= User.count %></p>
---
SELECT COUNT(*) FROM "users"