app/views/visitors/mood.html.erb

SELECT COUNT(*) FROM "users"
---

<p> OLD: <%= link_to 'Users:', users_path %> <%= User.count %> registered</p>