app/controllers/match_controller.rb

  def index
    set_interestID
    if session[:interest_id] != nil && user_signed_in?
      @userInterestMapping = UserInterestMapping.where(interestID: session[:interest_id]).where.not(userID: current_user[:id]).order("RANDOM()").limit(3)
    elsif session[:interest_id] != nil && !user_signed_in?
      puts "i'm here"
      @userInterestMapping = UserInterestMapping.where(interestID: session[:interest_id]).order("RANDOM()").limit(1)
    else
      @userInterestMapping = UserInterestMapping.order("RANDOM()").limit(1)
    end
    @users = []
    if @userInterestMapping != nil
      if session[:interest_id] != nil && user_signed_in?
        @uumap = UserUserMapping.find_by_primeUserID(current_user[:id])
        @sentList =  @uumap["sent"].split(',')
        @completematchList = @uumap["completematch"].split(',')
        @nomatchList = @uumap["nomatch"].split(',')
        @userInterestMapping.each do |map|
          unless @sentList.include?(map.userID) || @nomatchList.include?(map.userID) || @completematchList.include?(map.userID)
            @users << User.find(map.userID)
---
SELECT "user_interest_mappings".* FROM "user_interest_mappings" WHERE "user_interest_mappings"."interestID" = $1  [["interestID", "4"]]
SELECT  "user_interest_mappings".* FROM "user_interest_mappings" WHERE (interestID: 4) AND "user_interest_mappings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "user_interest_mappings".* FROM "user_interest_mappings" WHERE "user_interest_mappings"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 17], ["LIMIT", 1]]