app/controllers/mood_controller.rb

  def index
    @interestList=Interest.all
---
SELECT "interests".* FROM "interests"

  def create
    session[:interest_id] = params[:interest_id]
    puts params
    if user_signed_in?
      @user_id = current_user[:id]
      @interest_id = params[:interest_id]
      #map = { userID: @user_id, interestID:@interest_id }
      #puts map
      @update_user = UserInterestMapping.where(userID: @user_id).first()
      if @update_user == nil
        UserInterestMapping.create( userID: @user_id, interestID:@interest_id )
      else
        if @update_user.interestID == @interest_id.to_s
          @update_user.save
---
SELECT  "user_interest_mappings".* FROM "user_interest_mappings" WHERE "user_interest_mappings"."userID" = $1 ORDER BY "user_interest_mappings"."id" ASC LIMIT $2  [["userID", "4"], ["LIMIT", 1]]
INSERT INTO "user_interest_mappings" ("userID", "interestID", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["userID", "17"], ["interestID", "6"], ["created_at", "2017-10-18 03:36:18.785505"], ["updated_at", "2017-10-18 03:36:18.785505"]]
UPDATE "user_interest_mappings" SET "interestID" = $1, "updated_at" = $2 WHERE "user_interest_mappings"."id" = $3  [["interestID", "9"], ["updated_at", "2017-10-20 23:17:59.950988"], ["id", 1]]