app/controllers/static_pages_controller.rb

SELECT "interests".* FROM "interests"
---
  def interest
  	@interestList=Interest.all