app/controllers/visitors_controller.rb

  def mood
  	@interestList=Interest.all
---
SELECT "interests".* FROM "interests"