app/controllers/users/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "dasdas@sdasd.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "dasdas@sdasd.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    puts params
    if !User.exists?(email: params[:user][:email])
      sign_up_params = sign_in_params.clone
      sign_up_params.store(:name, params[:user][:email].split('@')[0])
      sign_up_params.store(:password_confirmation, params[:user][:password])
      build_resource(sign_up_params)
      resource.save
      yield resource if block_given?
      if resource.persisted?
        if resource.active_for_authentication?
          set_flash_message! :notice, :signed_up
          sign_up(resource_name, resource)
          respond_with resource, location: after_sign_up_path_for(resource)
        else
          set_flash_message! :notice, :"signed_up_but_#{resource.inactive_message}"
          expire_data_after_sign_in!
          respond_with resource, location: after_inactive_sign_up_path_for(resource)
        end
      else
        clean_up_passwords resource
        set_minimum_password_length
        respond_with resource
      end
    else
      super
    end
    @user = User.find_by email: params[:user][:email]
    @userData=UserUserMapping.find_by primeUserID: @user.id
    if @userData == nil
      @createUser = UserUserMapping.create(primeUserID: @user.id, timeslot: "", sent: "", received: "", completematch: "", nomatch: "")